///Игра жанра RTS (Real Time Strategy) по типу starcraft --- p.s. не имею представления как реализовать это в консоле,
///поэтому пока все вещи сделаны через пошаговое меню.
///
///https://www.youtube.com/watch?v=DsDXV7aq2kI --- что хочу в идеале))
/// 
///Имеется возможность создавать различных юнитов, они имеют разные способности.
///Кто-то умеет драться, а кто-то не умеет, но зато умеет строить.
///Также есть различные постройки, с помощью которых мы можем создавать юнитов.
///
///Боевка незамысловатая, можно выбрать двух конуертных юнитов которые будут драться.
///Они деруться до тех пор пока кто-то из них не умрет. 
///Так как вариаций юнитов мало (лучник, воин, строитель, постройки) есть только одна разница
///Лучник имеет больше урона, но при этом у него не 100%-ая аккуратность.
///Воин имеет меньше урона и у него 100%-ая точность если он близко к цели и ||нулевая если он находиться на расстоянии||
    

